Revit.Elements.DirectShape
A Revit DirectShape, which is a wrapper for some other geometrical entities

Revit.Elements.DirectShape.InternalElement
Reference to the Element

Revit.Elements.DirectShape.#ctor(Autodesk.Revit.DB.DirectShape)
Wrap an existing DirectShape.
shape:

Revit.Elements.DirectShape.#ctor(Autodesk.DesignScript.Geometry.DesignScriptEntity,System.String,Revit.Elements.Category,Revit.Elements.Material)
Internal Constructor for a new DirectShape

Revit.Elements.DirectShape.InitDirectShape(Autodesk.Revit.DB.DirectShape)
Initialize a DirectShape element

Revit.Elements.DirectShape.InitDirectShape(Autodesk.DesignScript.Geometry.DesignScriptEntity,System.String,Revit.Elements.Category,Revit.Elements.Material)
Initialize a DirectShape element

Revit.Elements.DirectShape.NewDirectShape(System.Collections.Generic.IList{Autodesk.Revit.DB.GeometryObject},Autodesk.Revit.DB.Document,Autodesk.Revit.DB.ElementId,System.String,System.String)
Create a new DirectShape element from given list of Revit GeometryObjects, document, category, and Iddata

Revit.Elements.DirectShape.InternalSetDirectShape(Autodesk.Revit.DB.DirectShape)
SetInternalElement to a DirectShape element

Revit.Elements.DirectShape.InternalSetShape(Autodesk.DesignScript.Geometry.DesignScriptEntity,Autodesk.Revit.DB.ElementId,System.String)
Sets the internalDirectShape's shape to point to some geometry,
this method also generates tessellated geometry from the protogeometry object
and sets the material of the generated Revit faces

Revit.Elements.DirectShape.InternalSetName(Autodesk.DesignScript.Geometry.DesignScriptEntity,System.String,Revit.Elements.Material,Revit.Elements.Category)
Sets the internalDirectShape to have a new name
if this method detects the default string it generates a more specific name

Revit.Elements.DirectShape.ByGeometry(Autodesk.DesignScript.Geometry.Geometry,Revit.Elements.Category,Revit.Elements.Material,System.String)
Create a Revit DirectShape given some geometry, a name for the shape, a Category, and Material.
The geometry will be tessellated before being placed in the Revit model
The category of a DirectShape cannot be changed after creation, so
a new DirectShape will be generated if the category input is changed.
geometry: A Solid or Surface that will be tessellated and placed in the Revit model as a DirectShape
name: A string name for the DirectShape
category: Must be a top level Built-in Category
material: A Material to apply to the faces of the DirectShape
Returns: A DirectShape Element

Revit.Elements.DirectShape.ByMesh(Autodesk.DesignScript.Geometry.Mesh,Revit.Elements.Category,Revit.Elements.Material,System.String)
Create a Revit DirectShape given some geometry, a name for the shape, a Category, and Material.
The geometry will be tessellated before being placed in the Revit model
The category of a DirectShape cannot be changed after creation, so
a new DirectShape will be generated if the category input is changed.
mesh: A Mesh that will be tessellated and placed in the Revit model as a DirectShape
name: A string name for the DirectShape
category: Must be a top level Built-in Category
material: A Material to apply to the faces of the DirectShape
Returns: A DirectShape Element

Revit.Elements.DirectShape.FromExisting(Autodesk.Revit.DB.DirectShape,System.Boolean)
Construct a DirectShape from the Revit document.
directShape:
isRevitOwned:
Returns:

Revit.Elements.DirectShape.ToString
Please see InternalSetName method